app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'nombre' => ['required', 'regex:/^[\pL\s]+$/u', 'max:50'],
            'apell' => ['required', 'regex:/^[\pL\s]+$/u', 'max:50'],
            'email' => ['required', 'email', 'max:100', 'unique:' . User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'nombre' => $request->nombre,
            'apell' => $request->apell,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`nombre`, `apell`, `email`, `password`, `updated_at`, `created_at`) values ('Jaime Andrés', 'Mejía Osorio', 'jandri20001@gmail.com', '$2y$12$YBvYXXq8m0wlb7OCweB7Lu10zboRP1pCVvZD2aKMk0vfnGaW2/BxS', '2024-03-03 19:51:05', '2024-03-03 19:51:05')